; domain
(define (domain dominio-drones)
  (:requirements :strips :typing)

  (:types
    dron persona localizacion caja contenido)

  (:predicates
    (dron-en ?d - dron ?l - localizacion)
    (caja-en ?c - caja ?l - localizacion)
    (persona-en ?p - persona ?l - localizacion)
    (sostiene-izq ?d - dron ?c - caja)
    (sostiene-der ?d - dron ?c - caja)
    (brazo-izq-libre ?d - dron)
    (brazo-der-libre ?d - dron)
    (necesita ?p - persona ?t - contenido)
    (tiene ?p - persona ?t - contenido)
    (contiene ?c - caja ?t - contenido))


  (:action coger-izq
    :parameters (
      ?d - dron 
      ?c - caja 
      ?l - localizacion
    )
    :precondition (
      and (dron-en ?d ?l) 
      (caja-en ?c ?l) 
      (brazo-izq-libre ?d)
    )
    :effect (
      and (sostiene-izq ?d ?c) 
      (not (caja-en ?c ?l)) 
      (not (brazo-izq-libre ?d))
    )
  )


  (:action coger-der
    :parameters (
      ?d - dron 
      ?c - caja 
      ?l - localizacion
    )
    :precondition (
      and (dron-en ?d ?l) 
      (caja-en ?c ?l) 
      (brazo-der-libre ?d)
    )
    :effect (
      and (sostiene-der ?d ?c) 
      (not (caja-en ?c ?l)) 
      (not (brazo-der-libre ?d))
    )
  )


  (:action volar
    :parameters (
      ?d - dron 
      ?from - localizacion 
      ?to - localizacion
    )
    :precondition (
      dron-en ?d ?from
    )
    :effect (
      and (not (dron-en ?d ?from)) 
      (dron-en ?d ?to)
    )
  )


  (:action entregar-izq
    :parameters (
      ?d - dron 
      ?c - caja 
      ?p - persona 
      ?l - localizacion 
      ?t - contenido
    )
    :precondition (
      and (sostiene-izq ?d ?c) 
      (dron-en ?d ?l) 
      (persona-en ?p ?l)              
      (contiene ?c ?t) 
      (necesita ?p ?t)
    )
    :effect (
      and (tiene ?p ?t) 
      (not (sostiene-izq ?d ?c)) 
      (not (necesita ?p ?t)) 
      (brazo-izq-libre ?d)
    )
  )


  (:action entregar-der
    :parameters (
      ?d - dron 
      ?c - caja 
      ?p - persona 
      ?l - localizacion 
      ?t - contenido
    )
    :precondition (
      and (sostiene-der ?d ?c) 
      (dron-en ?d ?l) 
      (persona-en ?p ?l)
      (contiene ?c ?t) 
      (necesita ?p ?t)
    )
    :effect (
      and (tiene ?p ?t) 
      (not (sostiene-der ?d ?c)) 
      (not (necesita ?p ?t)) 
      (brazo-der-libre ?d)
    )
  )
)

; problem
(define (problem problema)
  (:domain dominio-drones)
  
  (:objects
    d1 - dron
    p1 p2 p3 p4 - persona
    deposito l1 l2 l3 l4 - localizacion
    c1 c2 c3 c4 c5 c6 c7 - caja
    comida medicina agua - contenido)

  (:init
    ;; Ubicación inicial del dron y las cajas en el depósito
    (dron-en d1 deposito)
    (brazo-izq-libre d1)
    (brazo-der-libre d1)

    (caja-en c1 deposito) (contiene c1 comida)
    (caja-en c2 deposito) (contiene c2 medicina)
    (caja-en c3 deposito) (contiene c3 comida)
    (caja-en c4 deposito) (contiene c4 comida)
    (caja-en c5 deposito) (contiene c5 medicina)
    (caja-en c6 deposito) (contiene c6 medicina)
    (caja-en c7 deposito) (contiene c7 comida)

    ;; Ubicación de las personas y sus necesidades
    (persona-en p1 l1) (necesita p1 comida)
    (persona-en p2 l2) (necesita p2 medicina)
    (persona-en p3 l3) (necesita p3 comida)
    (persona-en p4 l4) (necesita p4 comida))

  (:goal 
    (and
      (tiene p1 comida)
      (tiene p2 medicina)
      (tiene p3 comida)
      (tiene p4 comida)))
)

; plan
1. (coger-der d1 c6 deposito)
   deleted: (caja-en c6 deposito) (brazo-der-libre d1)
   added: (sostiene-der d1 c6)
   goals met: 0 of 4
2. (coger-izq d1 c7 deposito)
   deleted: (caja-en c7 deposito) (brazo-izq-libre d1)
   added: (sostiene-izq d1 c7)
   goals met: 0 of 4
3. (volar d1 deposito l2)
   deleted: (dron-en d1 deposito)
   added: (dron-en d1 l2)
   goals met: 0 of 4
4. (entregar-der d1 c6 p2 l2 medicina)
   deleted: (sostiene-der d1 c6) (necesita p2 medicina)
   added: (tiene p2 medicina) (brazo-der-libre d1)
   goals met: 1 of 4
5. (volar d1 l2 deposito)
   deleted: (dron-en d1 l2)
   added: (dron-en d1 deposito)
   goals met: 1 of 4
6. (coger-der d1 c4 deposito)
   deleted: (caja-en c4 deposito) (brazo-der-libre d1)
   added: (sostiene-der d1 c4)
   goals met: 1 of 4
7. (volar d1 deposito l1)
   deleted: (dron-en d1 deposito)
   added: (dron-en d1 l1)
   goals met: 1 of 4
8. (volar d1 l1 l3)
   deleted: (dron-en d1 l1)
   added: (dron-en d1 l3)
   goals met: 1 of 4
9. (entregar-der d1 c4 p3 l3 comida)
   deleted: (sostiene-der d1 c4) (necesita p3 comida)
   added: (tiene p3 comida) (brazo-der-libre d1)
   goals met: 2 of 4
10. (volar d1 l3 deposito)
   deleted: (dron-en d1 l3)
   added: (dron-en d1 deposito)
   goals met: 2 of 4
11. (coger-der d1 c3 deposito)
   deleted: (caja-en c3 deposito) (brazo-der-libre d1)
   added: (sostiene-der d1 c3)
   goals met: 2 of 4
12. (volar d1 deposito l1)
   deleted: (dron-en d1 deposito)
   added: (dron-en d1 l1)
   goals met: 2 of 4
13. (volar d1 l1 l4)
   deleted: (dron-en d1 l1)
   added: (dron-en d1 l4)
   goals met: 2 of 4
14. (entregar-der d1 c3 p4 l4 comida)
   deleted: (sostiene-der d1 c3) (necesita p4 comida)
   added: (tiene p4 comida) (brazo-der-libre d1)
   goals met: 3 of 4
15. (volar d1 l4 l1)
   deleted: (dron-en d1 l4)
   added: (dron-en d1 l1)
   goals met: 3 of 4
16. (entregar-izq d1 c7 p1 l1 comida)
   deleted: (sostiene-izq d1 c7) (necesita p1 comida)
   added: (tiene p1 comida) (brazo-izq-libre d1)
   goals met: 4 of 4
